# YOLO11n + UIB Backbone (P3/8 - P5/32). Head giữ nguyên YOLO11n.

nc: 80

scales:
  n: [0.50, 0.25, 1024]
  s: [0.50, 0.50, 1024]
  m: [0.50, 1.00, 512]
  l: [1.00, 1.00, 512]
  x: [1.00, 1.50, 512]

backbone:
  - [-1, 1, UIBDown, [64, 3, 2, 6.0]]       # P1/2
  - [-1, 1, UIBDown, [128, 3, 2, 6.0]]      # P2/4

  - [-1, 1, UIB,     [256, 3, 1, 6.0]]
  - [-1, 1, UIB,     [256, 3, 1, 6.0]]

  - [-1, 1, UIBDown, [256, 3, 2, 6.0]]      # P3/8

  - [-1, 1, UIB,     [512, 3, 1, 6.0]]
  - [-1, 1, UIB,     [512, 3, 1, 6.0]]      # P3 out

  - [-1, 1, UIBDown, [512, 3, 2, 6.0]]      # P4/16

  - [-1, 1, UIB,     [512, 3, 1, 6.0]]
  - [-1, 1, UIB,     [512, 3, 1, 6.0]]      # P4 out

  - [-1, 1, UIBDown, [1024, 3, 2, 6.0]]     # P5/32

  - [-1, 1, UIB,     [1024, 3, 1, 6.0]]
  - [-1, 1, UIB,     [1024, 3, 1, 6.0]]     # P5 out

  - [-1, 1, SPPF,    [1024, 5]]
  - [-1, 2, C2PSA,   [1024]]
# 14

head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 15
  - [[-1, 9], 1, Concat, [1]]                      # 16  cat backbone P4
  - [-1, 2, C3k2, [512, False]]                     # 17

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]     # 18
  - [[-1, 6], 1, Concat, [1]]                      # 19  cat backbone P3
  - [-1, 2, C3k2, [256, False]]                     # 20  (P3/8)

  - [-1, 1, Conv, [256, 3, 2]]                     # 21
  - [[-1, 17], 1, Concat, [1]]                     # 22  cat head P4
  - [-1, 2, C3k2, [512, False]]                     # 23  (P4/16)

  - [-1, 1, Conv, [512, 3, 2]]                     # 24
  - [[-1, 14], 1, Concat, [1]]                     # 25  cat head P5
  - [-1, 2, C3k2, [1024, True]]                     # 26  (P5/32)

  - [[20, 23, 26], 1, Detect, [nc]]                # 27
